nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018m/project_template/pin_mux.h
/*! @name PIO3_14 (coord E3), J13[5]/LED1/P3_14-CT3MAT1-USR_LED1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED1_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */
#define BOARD_LED1_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_LED1_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_LED1_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDs(void); /* Function assigned for the Cortex-M4F */

#define PIO00_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO00_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO013_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO013_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO014_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO014_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO01_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO01_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO02_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO02_FUNC_ALT1 0x01u         /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO03_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO03_FUNC_ALT1 0x01u         /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO313_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO313_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO0_1 (coord A1), J13[4]/U27[2]/P0_25-SPIFI_IO1
  @{ */
#define BOARD_SPIFI_IO1_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_SPIFI_IO1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_SPIFI_IO1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO0_3 (coord A10), U28[B9]/RP3[3]/JS34[1]/U26[11]/J14[2]/P0_3-ISP_FC3_MOSI/P0_3-EMC_D1
  @{ */
#define BOARD_ISP_FC3_MOSI_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_ISP_FC3_MOSI_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_ISP_FC3_MOSI_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO0_2 (coord E9), U28[A8]/RP3[4]/JS35[1]/U24[11]/J14[3]/P0_2-ISP_FC3_MISO/P0_2-EMC_D0
  @{ */
#define BOARD_ISP_FC3_MISO_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_ISP_FC3_MISO_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_ISP_FC3_MISO_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO0_0 (coord D6), U26[13]/J14[4]/P0_0-ISP_FC3_SCK
  @{ */
#define BOARD_ISP_FC3_SCK_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_ISP_FC3_SCK_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_ISP_FC3_SCK_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PIO3_13 (coord H4), J14[8]/P3_13-BRIDGE_GPIO
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_BRIDGE_GPIO_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_BRIDGE_GPIO_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */
#define BOARD_BRIDGE_GPIO_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_BRIDGE_GPIO_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_BRIDGE_GPIO_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO0_13 (coord F11), JS16[2]/J14[9]/P0_13-ISP_FC1_SDAX
  @{ */
#define BOARD_ISP_FC1_SDAX_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_ISP_FC1_SDAX_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_ISP_FC1_SDAX_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_14 (coord E13), JS15[2]/J14[10]/P0_14-ISP_FC1_SCLX
  @{ */
#define BOARD_ISP_FC1_SCLX_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_ISP_FC1_SCLX_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_ISP_FC1_SCLX_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPMod_SPI_I2C_BRIDGE(void); /* Function assigned for the Cortex-M4F */

#define PIO323_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO323_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO324_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO324_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO34_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO34_FUNC_ALT0 0x00u         /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO3_23 (coord C2), J11[10]/J9[3]/U10[3]/J17[5]/U19[10]/P3_23-FC2_SDAX
  @{ */
#define BOARD_FC2_SDAX_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_FC2_SDAX_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_FC2_SDAX_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                 /* @} */

