nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018m/project_template/pin_mux.h
/*! @name PIO3_24 (coord E2), J11[9]/J9[1]/U10[2]/J17[4]/U19[2]/P3_24-FC2_SCLX
  @{ */
#define BOARD_FC2_SCLX_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_FC2_SCLX_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_FC2_SCLX_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO3_4 (coord B11), J12[10]/U19[3]/P3_4-ACCL_INTR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_ACCL_INTR_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_ACCL_INTR_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */
#define BOARD_ACCL_INTR_PORT 3U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_ACCL_INTR_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_ACCL_INTR_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCEL(void); /* Function assigned for the Cortex-M4F */

#define PIO212_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO212_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO2_12 (coord M2), U26A1[3]/P2_12-SPIFI_RSTn
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SPIFI_RSTn_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_SPIFI_RSTn_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */
#define BOARD_SPIFI_RSTn_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_SPIFI_RSTn_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_SPIFI_RSTn_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitQSPI_FLASH(void); /* Function assigned for the Cortex-M4F */

#define PIO210_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO210_FUNC_ALT2 0x02u        /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO23_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO23_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO24_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO24_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO25_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO25_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO26_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO26_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO27_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO27_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO28_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO28_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO29_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO29_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO315_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO315_FUNC_ALT2 0x02u        /*!<@brief Selects pin function.: Alternative connection 2. */

/*! @name PIO3_15 (coord D2), RP1[1]/U9[8]/P3_15-SD_WPn
  @{ */
#define BOARD_SD_WPn_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_SD_WPn_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_SD_WPn_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO2_10 (coord P1), RP1[2]/U9[7]/P2_10-SD_CDn
  @{ */
#define BOARD_SD_CDn_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_SD_CDn_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_SD_CDn_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO2_8 (coord F4), RP1[3]/U9[6]/P2_8-SD_D2
  @{ */
#define BOARD_SD_D2_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_SD_D2_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_SD_D2_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PIO2_7 (coord J2), RP1[4]/U9[5]/P2_7-SD_D1
  @{ */
#define BOARD_SD_D1_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_SD_D1_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_SD_D1_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PIO2_6 (coord F3), RP1[5]/U9[4]/P2_6-SD_D0
  @{ */
#define BOARD_SD_D0_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_SD_D0_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_SD_D0_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PIO2_3 (coord B1), U9[3]/P2_3-SD_CLK
  @{ */
#define BOARD_SD_CLK_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_SD_CLK_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_SD_CLK_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO2_4 (coord D3), RP1[6]/U9[2]/P2_4-SD_CMD
  @{ */
#define BOARD_SD_CMD_PORT 2U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_SD_CMD_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_SD_CMD_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                              /* @} */

