nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018m/project_template/pin_mux.h
/*! @name PIO1_19 (coord L1), U28[E1]/RP4[4]/P1_19-EMC_D8
  @{ */
#define BOARD_EMC_D8_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D8_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D8_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO0_9 (coord G12), U28[E9]/RP5[1]/P0_9-EMC_D7
  @{ */
#define BOARD_EMC_D7_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D7_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D7_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO0_8 (coord H10), U28[D8]/RP5[2]/P0_8-EMC_D6
  @{ */
#define BOARD_EMC_D6_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D6_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D6_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO0_7 (coord H12), U28[D9]/RP5[3]/P0_7-EMC_D5
  @{ */
#define BOARD_EMC_D5_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D5_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D5_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO0_6 (coord A5), U28[C8]/RP5[4]/SW2/P0_6-ISP2/P0_6-EMC_D4
  @{ */
#define BOARD_EMC_D4_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D4_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D4_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO0_5 (coord E7), U28[C9]/RP3[1]/JS32[1]/SW3/P0_5-ISP1/P0_5-EMC_D3
  @{ */
#define BOARD_EMC_D3_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D3_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D3_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO0_4 (coord C8), U28[B8]/RP3[2]/JS32[3]/SW4/P0_4-ISP0/P0_4-EMC_D2
  @{ */
#define BOARD_EMC_D2_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D2_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D2_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO0_3 (coord A10), U28[B9]/RP3[3]/JS34[1]/U26[11]/J14[2]/P0_3-ISP_FC3_MOSI/P0_3-EMC_D1
  @{ */
#define BOARD_EMC_D1_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D1_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D1_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO0_2 (coord E9), U28[A8]/RP3[4]/JS35[1]/U24[11]/J14[3]/P0_2-ISP_FC3_MISO/P0_2-EMC_D0
  @{ */
#define BOARD_EMC_D0_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_D0_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_EMC_D0_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PIO1_14 (coord C12), U28[F1]/P1_14-EMC_DQM1
  @{ */
#define BOARD_EMC_DQM1_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_DQM1_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_EMC_DQM1_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO1_13 (coord G10), U28[E8]/P1_13-EMC_DQM0
  @{ */
#define BOARD_EMC_DQM0_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_DQM0_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_EMC_DQM0_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO1_11 (coord B4), U28[F2]/P1_11-EMC_CLK0
  @{ */
#define BOARD_EMC_CLK0_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_CLK0_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_EMC_CLK0_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO1_15 (coord A11), U28[F3]/P1_15-EMC_CKE0
  @{ */
#define BOARD_EMC_CKE0_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_EMC_CKE0_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_EMC_CKE0_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAMPins(void); /* Function assigned for the Cortex-M4F */

#define PIO029_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO029_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO030_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO030_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */

/*! @name PIO0_29 (coord B13), U24[13]/P0_29-ISP_FC0_RXD
  @{ */
#define BOARD_ISP_FC0_RXD_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_ISP_FC0_RXD_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_ISP_FC0_RXD_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO0_30 (coord A2), U24[12]/P0_30-ISP_FC0_TXD
  @{ */
#define BOARD_ISP_FC0_TXD_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_ISP_FC0_TXD_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_ISP_FC0_TXD_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UART(void); /* Function assigned for the Cortex-M4F */

#define PIO010_ANAMODE_DISABLED 0x01u /*!<@brief Enables or disables analog mode.: Disable analog Mode. */
#define PIO010_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO010_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO011_ANAMODE_DISABLED 0x01u /*!<@brief Enables or disables analog mode.: Disable analog Mode. */
#define PIO011_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO011_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO012_ANAMODE_DISABLED 0x01u /*!<@brief Enables or disables analog mode.: Disable analog Mode. */
#define PIO012_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO012_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */

/*! @name PIO0_12 (coord M3), P1[2]/U22[4]/D5[5]/IF_SWDIO
  @{ */
#define BOARD_IF_SWDIO_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_IF_SWDIO_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_IF_SWDIO_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PIO0_11 (coord L3), U16[4]/SWDCLK_TRGT
  @{ */
#define BOARD_SWDCLK_TRGT_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_SWDCLK_TRGT_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_SWDCLK_TRGT_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                    /* @} */

