nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018m/project_template/pin_mux.h
/*! @name PIO4_13 (coord B6), U12[16]/P4_13-ENET_TX_EN
  @{ */
#define BOARD_INITENET_ENET_TX_EN_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENET_ENET_TX_EN_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITENET_ENET_TX_EN_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO4_11 (coord A9), U12[8]/JP12[1]/J3[4]/JP12[3]/P4_11-USB0_ID/P4_11-ENET_RXD0
  @{ */
#define BOARD_INITENET_ENET_RXD0_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENET_ENET_RXD0_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITENET_ENET_RXD0_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO4_12 (coord A6), U12[7]/P4_12-ENET_RXD1
  @{ */
#define BOARD_INITENET_ENET_RXD1_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENET_ENET_RXD1_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITENET_ENET_RXD1_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO4_10 (coord B9), U12[11]/P4_10-ENET_CRS_DV
  @{ */
#define BOARD_INITENET_ENET_CRS_DV_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENET_ENET_CRS_DV_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITENET_ENET_CRS_DV_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO2_26 (coord H11), U12[15]/P2_26-ENET_PHY_RSTn
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITENET_ENET_PHY_RSTn_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITENET_ENET_PHY_RSTn_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */
#define BOARD_INITENET_ENET_PHY_RSTn_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENET_ENET_PHY_RSTn_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITENET_ENET_PHY_RSTn_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO4_14 (coord B5), JS18[2]/P4_14-ENET_RX_CLK
  @{ */
#define BOARD_INITENET_ENET_RX_CLK_PORT 4U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITENET_ENET_RX_CLK_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITENET_ENET_RX_CLK_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENET(void); /* Function assigned for the Cortex-M4F */

#define PIO12_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO12_FUNC_ALT5 0x05u        /*!<@brief Selects pin function.: Alternative connection 5. */
#define PIO13_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO13_FUNC_ALT5 0x05u        /*!<@brief Selects pin function.: Alternative connection 5. */

/*! @name PIO1_2 (coord L14), J13[18]/JS25[3]/DMIC1[4]/P1_2-PDM1_CLK
  @{ */
#define BOARD_PDM1_CLK_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_PDM1_CLK_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_PDM1_CLK_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PIO1_3 (coord J13), JS26[3]/DMIC1[1]/P1_3-PDM1_DATA
  @{ */
#define BOARD_PDM1_DATA_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_PDM1_DATA_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_PDM1_DATA_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDMIC(void); /* Function assigned for the Cortex-M4F */

#define PIO218_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO218_FUNC_ALT3 0x03u        /*!<@brief Selects pin function.: Alternative connection 3. */
#define PIO219_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO219_FUNC_ALT3 0x03u        /*!<@brief Selects pin function.: Alternative connection 3. */
#define PIO220_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO220_FUNC_ALT2 0x02u        /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO311_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO311_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO323_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO323_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO324_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO324_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO41_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO41_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO42_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO42_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO43_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO43_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */

/*! @name PIO4_1 (coord G14), U10[29]/J9[14]/P4_1-FC6_I2S_TX_SCK
  @{ */
#define BOARD_FC6_I2S_TX_SCK_PORT 4U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_FC6_I2S_TX_SCK_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_FC6_I2S_TX_SCK_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                      /* @} */

