nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018m/project_template/pin_mux.h
/*! @name PIO4_3 (coord F13), U10[30]/J9[12]/P4_3-FC6_I2S_TX_WS
  @{ */
#define BOARD_FC6_I2S_TX_WS_PORT 4U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_FC6_I2S_TX_WS_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_FC6_I2S_TX_WS_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO4_2 (coord F14), U10[32]/J9[10]/P4_2-FC6_I2S_TX_DATA
  @{ */
#define BOARD_FC6_I2S_TX_DATA_PORT 4U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_FC6_I2S_TX_DATA_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_FC6_I2S_TX_DATA_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO2_19 (coord P12), U10[31]/J9[20]/P2_19-FC7_I2S_RX_DAT
  @{ */
#define BOARD_FC7_I2S_RX_DAT_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_FC7_I2S_RX_DAT_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_FC7_I2S_RX_DAT_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO2_18 (coord N10), U10[29]/J9[16]/P2_18-FC7_I2S_RX_SCK
  @{ */
#define BOARD_FC7_I2S_RX_SCK_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_FC7_I2S_RX_SCK_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_FC7_I2S_RX_SCK_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO2_20 (coord P13), U10[30]/J9[18]/P2_20-FC7_I2S_RX_WS
  @{ */
#define BOARD_FC7_I2S_RX_WS_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_FC7_I2S_RX_WS_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_FC7_I2S_RX_WS_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO3_11 (coord B2), J11[8]/J12[7]/P3_11-MCLK-PMOD2_GPIO
  @{ */
#define BOARD_MCLK_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_MCLK_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_MCLK_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2S(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
